# CH2   : Le langage SQL


# 1. des cellules bien utiles 
Ces cellules sont à exécuter en début ou fin de TP , au besoin

In [45]:
# importation du module sqlite3
import sqlite3

In [46]:
# pour ouvrir/créer la base de données
conn = sqlite3.connect("./SF2.db")  # connection à la base : si elle n'existe pas, elle est créée
cur = conn.cursor() # creation d'un curseur

In [42]:
# pour fermer la base
cur.close()
conn.close()

In [11]:
def requete(myText):
    '''
    une fonction bien utile !
    text -> list ou ...
    exécute la requete sql myText et renvoie le résultat de celle-ci '''
    cur.execute(myText)
    results = cur.fetchall()
    return results

# 2. Création d'une base de données SF

La commande sqlite3.connect permet de créer une base de données, il s'agit maintenant de créer les tables, et d'y insérer des **enregistrements**

### 2.1 Création de table
syntaxe SQL de la création d'une table :

    CREATE TABLE nomtable ( attribut1 TYPE1, attribut2 TYPE2 ...) ;

le type peut être INT, TEXT, DATE etc ...

In [47]:
requete(' CREATE TABLE AUTEURS \
(id INT, nom TEXT, prenom TEXT, ann_naissance INT, langue_ecriture TEXT);')

OperationalError: table AUTEURS already exists

Plus prudent pour éviter les doublons :

``CREATE TABLE nomtable IF NOT EXISTS( attribut1 TYPE1, attribut2 TYPE2 ...) ;``

### 2.2 Insertion d'enregistrements 

La syntaxe SQL est la suivante :

    INSERT INTO nomtable (attribut1, attribut2, ...) VALUES (valeur,valeur, ...), (valeur,valeur) .... ;
    
à noter qu'on peut mettre autant d'enregistrement que voulus

In [49]:
requete("INSERT INTO AUTEURS \
(id,nom,prenom,ann_naissance,langue_ecriture) \
VALUES \
(1,'Orwell','George',1903,'anglais'), \
(2,'Herbert','Frank',1920,'anglais'), \
(3,'Asimov','Isaac',1920,'anglais'), \
(4,'Huxley','Aldous',1894,'anglais'), \
(5,'Bradbury','Ray',1920,'anglais'), \
(6,'K.Dick','Philip',1928,'anglais'), \
(7,'Barjavel','René',1911,'français'), \
(8,'Boulle','Pierre',1912,'français'), \
(9,'Van Vogt','Alfred Elton',1912,'anglais'), \
(10,'Verne','Jules',1828,'français');")

[]

La commande ***select***  permet de récupérer des enregistrements, utilisons-la pour vérifier si la table est bien fournie (* signifie tous les attributs). Nous reviendrons sur la commande ***select*** plus tard.

In [50]:
requete('select * from "AUTEURS"')

[(1, 'Orwell', 'George', 1903, 'anglais'),
 (2, 'Herbert', 'Frank', 1920, 'anglais'),
 (3, 'Asimov', 'Isaac', 1920, 'anglais'),
 (4, 'Huxley', 'Aldous', 1894, 'anglais'),
 (5, 'Bradbury', 'Ray', 1920, 'anglais'),
 (6, 'K.Dick', 'Philip', 1928, 'anglais'),
 (7, 'Barjavel', 'René', 1911, 'français'),
 (8, 'Boulle', 'Pierre', 1912, 'français'),
 (9, 'Van Vogt', 'Alfred Elton', 1912, 'anglais'),
 (10, 'Verne', 'Jules', 1828, 'français')]

Passons maintenant à la table LIVRES

In [51]:
requete('CREATE TABLE LIVRES \
(id INT, titre TEXT, id_auteur INT, ann_publi INT, note INT);')

[]

In [52]:
requete("INSERT INTO LIVRES\
(id,titre,id_auteur,ann_publi,note)\
VALUES\
(1,'1984',1,1949,10),\
(2,'Dune',2,1965,8),\
(3,'Fondation',3,1951,9),\
(4,'Le meilleur des mondes',4,1931,7),\
(5,'Fahrenheit 451',5,1953,7),\
(6,'Ubik',6,1969,9),\
(7,'Chroniques martiennes',5,1950,8),\
(8,'La nuit des temps',7,1968,7),\
(9,'Blade Runner',6,1968,8),\
(10,'Les Robots',3,1950,9),\
(11,'La Planète des singes',8,1963,8),\
(12,'Ravage',7,1943,8),\
(13,'Le Maître du Haut Château',6,1962,8),\
(14,'Le monde des Ā',9,1945,7),\
(15,'La Fin de l’éternité',3,1955,8),\
(16,'De la Terre à la Lune',10,1865,10);")

[]

In [18]:
# vérification
requete('select * from "LIVRES"')

[(1, '1984', 1, 1949, 10),
 (2, 'Dune', 2, 1965, 8),
 (3, 'Fondation', 3, 1951, 9),
 (4, 'Le meilleur des mondes', 4, 1931, 7),
 (5, 'Fahrenheit 451', 5, 1953, 7),
 (6, 'Ubik', 6, 1969, 9),
 (7, 'Chroniques martiennes', 5, 1950, 8),
 (8, 'La nuit des temps', 7, 1968, 7),
 (9, 'Blade Runner', 6, 1968, 8),
 (10, 'Les Robots', 3, 1950, 9),
 (11, 'La Planète des singes', 8, 1963, 8),
 (12, 'Ravage', 7, 1943, 8),
 (13, 'Le Maître du Haut Château', 6, 1962, 8),
 (14, 'Le monde des Ā', 9, 1945, 7),
 (15, 'La Fin de l’éternité', 3, 1955, 8),
 (16, 'De la Terre à la Lune', 10, 1865, 10)]

### 2.3 La commande select

Il s'agit maintenant de consulter la table. Il est essentiel de savoir sélectionner uniquement ce qui nous intéresse, n'oublions pas qu'une base de données peut contenir  des millions de données.

### 2.3.1 sélectionner des attributs
seuls le nom et le prénom des auteurs m'intéresse :

In [19]:
requete('SELECT nom,prenom FROM AUTEURS;')

[('Orwell', 'George'),
 ('Herbert', 'Frank'),
 ('Asimov', 'Isaac'),
 ('Huxley', 'Aldous'),
 ('Bradbury', 'Ray'),
 ('K.Dick', 'Philip'),
 ('Barjavel', 'René'),
 ('Boulle', 'Pierre'),
 ('Van Vogt', 'Alfred Elton'),
 ('Verne', 'Jules')]

### 2.3.2 sélectionner des enregistrements selon des critères

Je ne veux que les auteurs nés au XIXème siècle

In [20]:
requete('SELECT * FROM AUTEURS WHERE ann_naissance < 1900')

[(4, 'Huxley', 'Aldous', 1894, 'anglais'),
 (10, 'Verne', 'Jules', 1828, 'français')]

On peut évidemment cumuler des critères avec AND , OR etc ...

## 2.3.3 Fonctions de groupes et tri

Quelques exemples valent mieux qu'un long discours

In [21]:
#COUNT on peut aussi utiliser MAX,MIN,AVG(moyenne),SUM
requete('SELECT COUNT(*) FROM AUTEURS WHERE ann_naissance < 1900')

[(2,)]

In [22]:
#TRI
requete('SELECT * FROM AUTEURS ORDER BY ann_naissance')

[(10, 'Verne', 'Jules', 1828, 'français'),
 (4, 'Huxley', 'Aldous', 1894, 'anglais'),
 (1, 'Orwell', 'George', 1903, 'anglais'),
 (7, 'Barjavel', 'René', 1911, 'français'),
 (8, 'Boulle', 'Pierre', 1912, 'français'),
 (9, 'Van Vogt', 'Alfred Elton', 1912, 'anglais'),
 (2, 'Herbert', 'Frank', 1920, 'anglais'),
 (3, 'Asimov', 'Isaac', 1920, 'anglais'),
 (5, 'Bradbury', 'Ray', 1920, 'anglais'),
 (6, 'K.Dick', 'Philip', 1928, 'anglais')]

## 3. La jointure 

Nous arrivons maintenant au point central du modèle relationnel. Je veux la liste des livres de Barjavel. Mais le nom Barjavel est à trouver dans la table AUTEURS et les livres dans la table LIVRES. 
Il faut donc réaliser une jointure sur l'attribut qu'ils ont en commun, c'est à dire l'identifiant de l'auteur.

In [23]:
requete('SELECT * FROM LIVRES \
INNER JOIN AUTEURS ON LIVRES.id_auteur= AUTEURS.id \
WHERE AUTEURS.nom = "Barjavel";')

[(8, 'La nuit des temps', 7, 1968, 7, 7, 'Barjavel', 'René', 1911, 'français'),
 (12, 'Ravage', 7, 1943, 8, 7, 'Barjavel', 'René', 1911, 'français')]

On voit que la jointure crée un table temporaire qui fusionne les enregistrements des deux tables. 
Pour simplifier la réponse :

In [24]:
requete('SELECT titre FROM LIVRES \
INNER JOIN AUTEURS ON LIVRES.id_auteur= AUTEURS.id \
WHERE AUTEURS.nom = "Barjavel";')

[('La nuit des temps',), ('Ravage',)]

Un autre exemple : je souhaite la liste des livres post 1950. Mais j'ai besoin d'un jointure pour afficher en même temps le nom de son auteur.

In [25]:
requete('SELECT titre,nom, prenom FROM LIVRES INNER JOIN AUTEURS ON LIVRES.id_auteur = AUTEURS.id WHERE ann_publi>1950 ')

[('Dune', 'Herbert', 'Frank'),
 ('Fondation', 'Asimov', 'Isaac'),
 ('Fahrenheit 451', 'Bradbury', 'Ray'),
 ('Ubik', 'K.Dick', 'Philip'),
 ('La nuit des temps', 'Barjavel', 'René'),
 ('Blade Runner', 'K.Dick', 'Philip'),
 ('La Planète des singes', 'Boulle', 'Pierre'),
 ('Le Maître du Haut Château', 'K.Dick', 'Philip'),
 ('La Fin de l’éternité', 'Asimov', 'Isaac')]

## 4  APPENDICE : effacements et mises à jour

### 4.1 Suppression d'une table ( à vos risques et périls !) : La commande DROP TABLE

In [ ]:
requete('DROP TABLE AUTEURS';)

### 4.2 Suppression d'un enregistrement  :  la commande DELETE

In [ ]:
requete('DELETE FROM LIVRES \
WHERE titre="Blade Runner";')

### 4.3 Mise à jour d'une donnée : la commande UPDATE

In [ ]:
requete('UPDATE LIVRES \
SET note=7 \
WHERE titre = "Hypérion"';)

On peut modifier la valeur de plusieurs attribus dans la ligne SET en les espaçant par des virgules.

## 5 Filtres

In [32]:
# commançant par
requete('SELECT * FROM LIVRES WHERE titre LIKE "L%";')

[(4, 'Le meilleur des mondes', 4, 1931, 7),
 (8, 'La nuit des temps', 7, 1968, 7),
 (10, 'Les Robots', 3, 1950, 9),
 (11, 'La Planète des singes', 8, 1963, 8),
 (13, 'Le Maître du Haut Château', 6, 1962, 8),
 (14, 'Le monde des Ā', 9, 1945, 7),
 (15, 'La Fin de l’éternité', 3, 1955, 8)]

In [35]:
# finissant par 
requete('SELECT * FROM LIVRES WHERE titre LIKE "%s";')

[(4, 'Le meilleur des mondes', 4, 1931, 7),
 (7, 'Chroniques martiennes', 5, 1950, 8),
 (8, 'La nuit des temps', 7, 1968, 7),
 (10, 'Les Robots', 3, 1950, 9),
 (11, 'La Planète des singes', 8, 1963, 8)]

In [38]:
#contenant
requete('SELECT * FROM AUTEURS WHERE nom LIKE "%ja%";')

[(7, 'Barjavel', 'René', 1911, 'français')]

In [40]:
#entre 
requete('SELECT * FROM LIVRES WHERE ann_publi BETWEEN 1900 AND 1950;')

[(1, '1984', 1, 1949, 10),
 (4, 'Le meilleur des mondes', 4, 1931, 7),
 (7, 'Chroniques martiennes', 5, 1950, 8),
 (10, 'Les Robots', 3, 1950, 9),
 (12, 'Ravage', 7, 1943, 8),
 (14, 'Le monde des Ā', 9, 1945, 7)]

In [41]:
#liste
requete('SELECT * FROM LIVRES WHERE ann_publi IN (1950,1951,1953);')

[(3, 'Fondation', 3, 1951, 9),
 (5, 'Fahrenheit 451', 5, 1953, 7),
 (7, 'Chroniques martiennes', 5, 1950, 8),
 (10, 'Les Robots', 3, 1950, 9)]